import json
import logging

logger = logging.getLogger(__name__)
logger.setLevel(logging.INFO)
file_handler = logging.FileHandler("../logs/services.log", "w")
file_formatter = logging.Formatter(
    "%(asctime)s - %(filename)s - %(levelname)s: %(message)s"
)
file_handler.setFormatter(file_formatter)
logger.addHandler(file_handler)


def search_in_operations(request: str, main_operations: list[dict]) -> str:
    """Функция поиска операций по переданному значению"""

    logger.info("Запущена функция поиска операций по значению")
    result = []
    for value in main_operations:
        if (
            value["Категория"] != ""
            and type(value["Категория"]) is str
            and value["Описание"] != ""
            and type(value["Описание"]) is str
            and type(request) is str
        ):
            if request in value["Категория"] or request in value["Описание"]:
                result.append(value)
    json_data = json.dumps(result, ensure_ascii=False)
    logger.info("Завершена функция поиска операций по значению")
    return json_data


a = search_in_operations(
    "Супермаркеты",
    [
        {
            "Дата операции": "14.01.2018 14:10:58",
            "Дата платежа": "15.01.2018",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -1.0,
            "Валюта операции": "EUR",
            "Сумма платежа": -70.2,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Рестораны",
            "MCC": 5812.0,
            "Описание": "Luhamaa Terminal  kohvik",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 70.2,
        },
        {
            "Дата операции": "14.01.2018 10:43:42",
            "Дата платежа": "15.01.2018",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -1.42,
            "Валюта операции": "EUR",
            "Сумма платежа": -99.68,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": 'Rimi Hm "Alfa"',
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 99.68,
        },
        {
            "Дата операции": "12.01.2018 16:38:58",
            "Дата платежа": "15.01.2018",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -4.62,
            "Валюта операции": "EUR",
            "Сумма платежа": -324.32,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Различные товары",
            "MCC": 5311.0,
            "Описание": "Maxima Lv R010",
            "Бонусы (включая кэшбэк)": 6,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 324.32,
        },
        {
            "Дата операции": "12.01.2018 16:15:56",
            "Дата платежа": "15.01.2018",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -26.56,
            "Валюта операции": "EUR",
            "Сумма платежа": -1864.51,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Одежда и обувь",
            "MCC": 5641.0,
            "Описание": "Varaviksne-veikals",
            "Бонусы (включая кэшбэк)": 37,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 1864.51,
        },
        {
            "Дата операции": "12.01.2018 16:04:18",
            "Дата платежа": "15.01.2018",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -6.96,
            "Валюта операции": "EUR",
            "Сумма платежа": -488.59,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Одежда и обувь",
            "MCC": 5641.0,
            "Описание": "Varaviksne-veikals",
            "Бонусы (включая кэшбэк)": 9,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 488.59,
        },
        {
            "Дата операции": "12.01.2018 15:58:01",
            "Дата платежа": "15.01.2018",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -28.29,
            "Валюта операции": "EUR",
            "Сумма платежа": -1985.96,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Одежда и обувь",
            "MCC": 5641.0,
            "Описание": "Varaviksne-veikals",
            "Бонусы (включая кэшбэк)": 39,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 1985.96,
        },
    ],
)
print(a)
